# -*- encoding=utf-8 -*-

#键盘输入月利润，定义一个变量承接结果
i=float(raw_input("请输入月利润"))
salary=0.0

#判断数据的合法性
if i<=0:
    print ("这个月要加油啦")

else:

    #月利润小于等于十万
    if i<=100000:
        salary=i*0.1
        print ("这个月的奖金是："+str(salary)+"元")

    #月利润在十万和二十万之间
    elif i>100000 and i<=200000:
        salary=10000+(i-100000)*0.075
        print ("这个月的奖金是：" + str(salary) + "元")

    #月利润在二十万和四十万之间
    elif i>200000 and i<=400000:
        salary=10000+7500+(i-200000)*0.05
        print ("这个月的奖金是：" + str(salary) + "元")

    #月利润在四十万和六十万之间
    elif i>400000 and i<=600000:
        salary=10000+7500+10000+(i-400000)*0.03
        print ("这个月的奖金是："+str(salary)+"元")

    #月利润在六十万和一百万之间
    elif i>600000 and i<=1000000:
        salary = 10000 + 7500 + 10000 +6000 +(i-600000)*0.015
        print ("这个月的奖金是：" + str(salary) + "元")

    #月利润大于一百万
    else:
        salary = 10000 + 7500 + 10000 + 6000 + 6000+(i-1000000)*0.01
        print ("这个月的奖金是："+str(salary)+"元")